{"meta":{"title":"Knowledge Has NO Limit","subtitle":null,"description":null,"author":"Chern Tau","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"Awesome Mac","slug":"Awesome Mac","date":"2017-10-01T04:47:34.000Z","updated":"2017-10-01T06:14:03.348Z","comments":true,"path":"2017/10/01/Awesome Mac/","link":"","permalink":"http://yoursite.com/2017/10/01/Awesome Mac/","excerpt":"","text":"Awesome MacContents Editors and IDE Development Tools Test Tools Command Line Tools Version Control Systems Databases Design and Product Virtual Machines Communication Data Recovery Tools Audio and Video Tools Reading and Writing Tools Ebooks FTP Clients Frameworks For Hybrid Applications Download Management Tools Online Storage Input Methods Web Browsers Translation Tools Proxy and VPN Tools Utilities Remote Login Software QuickLook Plugins Third Party App Markets Mac App Download Sites Editors and IDEapplications to edit text, I suggest the open-source editors Text Editors Atom - A hackable text editorfor the 21st century made by GitHub.Atom Plugins. Sublime Text - A sophisticated text editor for code, markup and prose. You’ll love the slick user interface, extraordinary features and amazing performance, Sublime Text Plugins. Brackets - A modern, open-source text editor that understands web design by Adobe. Espresso - The web editor for Mac is back. For people who make delightful, innovative and fast websites. Visual Studio Code - Microsoft’s free &amp; open-source editor, TypeScript friendly, VSCode Plugins. Emacs - A popular text editor used mainly on Unix-based systems by programmers, scientists, engineers, students, and system administrators. LightTable - The next generation code editor. TextMate - An editor that brings Apple’s approach to operating systems into the world of text editors. BBEdit - The leading professional HTML and text editor for Macintosh. Vim - A highly configurable text editor built to make creating and changing any kind of text very efficient, Vim Plugins. Vimr - Refined Vim Experience for OS X. ONI - An IDE powered by Neovim. micro - a modern and intuitive terminal-based text editor. HBuilder - An IDE for web development (Support HTML5), built by DCloud. Tincta - A text editor for Mac OS X. CotEditor - Lightweight plain-text editor for macOS. Chocolat Native text editor. IDEs Xcode - The essential IDE for iOS/macOS development. IntelliJ IDEA - A powerful Java IDE. (Free for Students) Coda2 - A fast, clean and powerful text editor. Eclipse - Popular open-source IDE, mainly for Java but with plugin support for a wide array of languages and platforms. WebStorm - The smartest JavaScript IDE by JetBrains. FREE for Students, check here for more info. NodeJS - Node.js integration. You definitely need this, quite a few features require it. EditorConfig - A JetBrains IDE plugin supporting the EditorConfig standard. Material Theme UI - Provides 3 modes, nice and clean. Deco IDE - The best IDE for building React Native apps. Xamarin Studio - Free cross platform C# IDE. Xamarin Studio supports iOS, Android and .Net development NetBeans IDE - A free and open-source IDE, mainly used for Java development, but supports many other languages and frameworks. Android Studio - The official IDE for Android, based on Intellij IDEA. Development Tools WeFlow - Development tools for front-end workflows based on tmt-workflow. Koala - A GUI application for Less, Sass, Compass and CoffeeScript compilation. CodeKit - Web development tool which can automatically compile Less, Sass, CoffeeScript, TypeScript, Jade and JavaScript, auto-refresh browsers and much more. PaintCode - PaintCode is a unique vector drawing app that generates Objective-C or Swift code in real time, acting as a bridge between developers and graphic designers. Hosts.prefpane - A system preference pane to manage your hosts file. iHosts - The only /etc/hosts editor on Mac App Store. SwitchHosts - A free and open-source app for hosts management &amp; switching.. Gas Mask - A simple hosts file manager for Mac OS X. DiffMerge - An application to visually compare and merge files. Gemini - An intelligent duplicate file finder. BetterRename - The most powerful and complete Mac file renaming application on the market. PPRows - An application which can calculate how many lines of code you write. Beyond Compare - Compare files and folders using simple, powerful commands that focus on the differences you are interested in and ignore those you are not. Kaleidoscope - A powerful compare tool for text, images and folders. It works perfectly with git, svn or other version control tools. Fanvas - Convert swf to html canvas animation. EnvPane - An OS X preference pane for environment variables. Dash - Awesome API documentation browser and code snippet manager. DLite - The simplest way to use Docker on OS X. SnippetsLab - Easy-to-use code snippets manager. StarUML - Powerful UML app. Vagrant Manager - Manage your vagrant machines in one place. zeplin - A collaboration tool for work between designers and developers. Go2Shell - Open terminal from Finder. SecureCRT - A terminal emulation which supports SSH, Telnet or other protocols. Finicky - An application that allows you to set up rules that decide which browser is opened for every link that would open the default browser. MJML - A framework that utilizes a semantic syntax and a rich standard components library, which allow users to easily create responsive emails. TeXstudio - An integrated writing environment for creating LaTeX documents. Vagrant - A tool for building and distributing development environments. FinderGo - 🐢 Open terminal quickly from Finder Localname - Provide access to your local development server LaunchRocket - Brew services management in Mac System Preferences. Regular Expression Editors Patterns - A regular expression editor. Reginald - A regular expression test application. RegexKitLite. Regex - A regular expression testing tool with an emphasis on simplicity. Reggy - An open-source regular expression editor. RegExRX - A development tool for regular expressions. Test Tools Wireshark - The world’s foremost and widely-used network protocol analyzer. Charles - An HTTP proxy / HTTP monitor / Reverse Proxy that enables a developer to view all of the HTTP and SSL / HTTPS traffic between their machine and the Internet. James - Open-source proxy tool for checking and mapping requests with http as well as https. mitmproxy - An interactive intercepting HTTP proxy for penetration testers and software developers Insomnia 3.0 - A beautiful HTTP testing tool. Cocoa Rest Client - A free open-source, native Apple OS X app for testing HTTP/REST endpoints. Paw - An advanced HTTP client. Cellist - HTTP debugging proxy for OS X. Integrity - A free website link checker for Mac. Postman - A powerful GUI platform to make your API development faster &amp; easier, from building API requests through testing, documentation and sharing. Command Line Tools Mac OS X Manual Pages - Manual pages recommended reference for a number of BSD and POSIX functions and tools. iTerm2 - iTerm2 is an amazing terminal emulator for OS X. tmux A “terminal multiplexer”, it enables a number of terminals (or windows) to be accessed and controlled from a single terminal. tmux is intended to be a simple, modern, BSD-licensed alternative to programs such as GNU screen. mas - A simple command line interface for the Mac App Store. cool-retro-term - A good looking terminal emulator which mimics the old cathode display. Oh my zsh - An open-source, community-driven framework for managing your ZSH configuration. It comes bundled with a ton of helpful functions, helpers, plugins, themes. autojump - A cd command that learns - easily navigate directories from the command line Prezto — Instantly Awesome Zsh - The configuration framework for Zsh; it enriches the command line interface environment with sane defaults, aliases, functions, auto completion, and prompt themes. Glances - Glances is a cross-platform curses-based system monitoring tool. Cakebrew - A GUI client for Homebrew. Install, check or remove apps, no command-line needed. ndm - Manage npm straight from the couch. Black Screen - A terminal emulator for the 21st century. Fish Shell - A smart and user-friendly terminal, which is similar with zsh oh-my-fish - Alternative to oh-my-zsh，on fishShell framework bash-it - Shameless ripoff of oh-my-zsh for bash. HyperTerm - A terminal built on web technologies. itunes-remote - Software for controlling iTunes via the terminal. mycli - A command line client for MySQL that can do auto-completion and syntax highlighting. Mac-CLI - The ultimate tool to manage your Mac. automatize the usage of your OS X system. m-cli - Swiss Army Knife for macOS. lnav - A log file navigator. cmus - A small, fast and powerful console music player for Unix-like operating systems. Serial - Full-featured serial terminal for the Mac. Version Control Systems Git - A distributed version control tool, the official website provides dozens of GUI clients for Mac. SVN - An open-source version control system. Version Control GUIs GitFinder - A fast and lightweight Git client for Mac with Finder integration. Fork - A fast and friendly Git client for Mac. Gitbar - Open-source，display Github contribution statistics on your menu bar. GitHub Desktop - The GitHub official GUI. OhMyStar Beautiful and efficient way to manage, explore and share your Github Stars. GitUp - A simple and powerful Git client. Hub - A command-line wrapper for Git that makes you better at GitHub. SourceTree - A free Git &amp; Mercurial client for Windows or Mac. Tower2 - The most powerful Git client for Mac and Windows. Versions - A Mac Subversion Client (SVN). Cornerstone - Powerful version control with a gorgeous interface. SmartGit - A Git client with support. GitKraken - The most popular Git GUI for Windows, Mac AND Linux. Version Control Managers GitLab - Open-source Git repo management software. Github - Code hosting, project management and deployment for software projects. Coding.net - A one-stop cloud platform for developers, free repository hosting, project collaboration, code quality assurance and Page service. phabricator - Open software engineering platform and fun adventure game. Gogs - Gogs (Go Git Service) is a painless self-hosted Git service. Gerrit - Provides web based code review and repository management for the Git version control system. Gitblit - Pure java Git solution for managing, viewing, and serving Git repositories. Databases Sequel Pro - MySQL database management for Mac OS X. MySQL Workbench - The official MySQL GUI. Navicat Data Modeler - Is a powerful and cost-effective database design tool which helps you build high-quality conceptual, logical and physical data models. SQLPro Studio - A simple, powerful database manager for macOS. Bdash - A modern SQL client application, supports MySQL, PostgreSQL (Redshift) and BigQuery. Postico - A Modern PostgreSQL client for Mac. ElectroCRUD - A modern MySQL CRUD application. Base 2 - An application for creating, designing, editing and browsing SQLite 3 database files. SQLight - Is an SQLite database manager tool. DB Browser for SQLite - The Official home of the DB Browser for SQLite. Postgres.app - The easiest way to get started with PostgreSQL on the Mac. PSequel - PostgreSQL GUI tool for Mac OS X. Robo 3T - Native and cross-platform MongoDB management tool (Admin UI). MongoBooster - Shell-centric and cross-platform GUI tool for MongoDB. It provides update-in-place, fluent query builder, ES6 syntax support and True IntelliSense experience. Mongo Management Studio - A simple MongoDB GUI. MongoChef - The GUI for MongoDB. Mongotron - A Mongo DB GUI built using Electron, and Angular Js. Chrome MySQL Admin - A powerful Chrome app to manage your MySQL. JackDB - A secure, collaborative environment for your queries and data-driven insights. Medis - GUI Manager for Redis. RedisDesktopManager - Cross-platform GUI management tool for Redis. MDB Explorer - MDB tool to open, read, export your MDB files to other formats and databases. Datum - SQLite - A full featured, modern, and fast SQLite manager. mongoDB.app - The easiest way to get started with mongoDB on the Mac. DataGrip - Database management software by JetBrains. FREE for Students, check here for more info Tableau Public - Free data-visualization software. Core Data Editor - Core Data Editor lets you easily view, edit and analyze applications‘ data. Keylord - Keylord is a desktop GUI client for Redis, Bolt, LevelDB and Memcached key-value databases. DBeaver - A Universal SQL Client Design and ProductDesign Tools Acorn - A great Mac OS X picture and photo editor, built for humans. Affinity Designer - Professional graphic design software for Mac. Affinity Photo - Professional image editing software for Mac. Blender - Free and open 3D creation software. Pixelmator - Full-featured image editor for Mac. Sketch - Professional digital design for mac. Sketch Toolbox - A super simple plugin manager for Sketch. Measure - Make it a fun to create spec for developers and teammates. User Flows - generating flow diagrams from Artboards. Sketch Cache Cleaner -Deletes hidden Sketch history files that can take a lot of space on your hard drive and that you would probably never use. Gravit Designer - Gravit Designer is a full featured free vector design app right at your fingertips. inklet - Turn your Mac trackpad into drawing board. Alchemy - An experimental, open-source drawing application with an emphasis on creating conceptual art. MyPaint - Is a simple drawing and painting program that works well with Wacom-style graphics tablets. GIMP - The GNU Image Manipulation Program. Inkscape - is a professional vector graphics editor. Monodraw - Powerful ASCII art editor designed for the Mac. SketchBook - Drawing software for concept design, comic art, and digital sketching. Tayasui Sketches - Professional drawing software. Art Text 3 - This is graphic design software specifically tuned for lettering, typography, text mockups and various artistic text effects. FontForge - Free (libre) font editor. Nik Collection - Google Nik collection. Paintbrush - A bitmap image editor. Krita - Open-source digital painting software for concept artists, digital painters, and illustrators. Vectr - Free graphics editor used to create vector graphics easily and intuitively. Principle - An application for designing animated and interactive user interfaces. MagicaVoxel - A free lightweight 8-bit voxel editor and interactive path tracing renderer. ScreenToLayers - Easily export your screen into a layered PSD file. Pixel Perfect - A tool to overlay design images over implementation and make it pixel perfect. Sparkle - Pro visual web design. Prototyping And Mind-mapping Tools Origami Studio - A new tool for designing modern interfaces, built and used by designers at Facebook. FLINTO - Quickly create interactive prototypes of mobile, desktop, or web apps. Kite - A powerful animation and prototyping application for Mac &amp; iOS. Justinmind - Prototyping platform for web and mobile apps. MockFlow - Online prototyping suite for web-design and usability testing. Axure RP 8 - Prototypes, specifications and diagrams in one tool. pencil - A free, open-source tool for making diagrams and GUI prototyping. Mockplus - Prototype faster, smarter and easier. OmniGraffle - Diagramming and graphic design for Mac, iPhone, and iPad. XMind - The most popular mind-mapping tool on the planet. Lighten - The best way to clarify thinking, boost productivity, brainstorm, and visualize concepts. Scapple - Practical mind-mapping software with free whiteboard-like layout. Framer - A tool for interactive prototyping. Balsamiq Mockups - A wire-framing tool that helps you work faster and smarter. Marvel - Simple design, prototyping and collaboration. MindNode - Mind-mapping software with an emphasis on simplicity and ease-of-use. WriteMapper - Get from idea to final draft in no time. SimpleMind - Is the world leader in cross platform Mind Mapping tools. Adobe XD (Experience Design) - The first all-in-one cross-platform tool for designing and prototyping websites and mobile apps. Other Tools TinyPNG4Mac - Open-source tool to compress images. Image2icon - Create and personalize icons from your pictures. ImageAlpha - Compress images with PNG format and remove transparency. Resize Master - Batch resize and watermark your images fast and easy. JPEGmini - Reduce image size by up to 80%, without compromising quality. ImageOptim - Compress images and remove EXIF information. Sip - The best way to collect, organize &amp; share your colors. Mark Man - Measure &amp; Spec Fast. Frank DeLoupe - A color-picking tool, supports Retina. ColorSchemer - A professional color matching application for your Mac. IconKit - An App icon generator. Snagit - Simple, Powerful Screen Capture Software and Screen Recorder. GifCapture GIF capture app for macOS. Gifox Gif Recording and Sharing. APNGb - A png image assembler/disassembler app. LICEcap - Record your screen and export to GIF. You can change the recording area anytime during recording. Kap - An open-source screen-recorder built with web technology. GIPHY Capture - Capture and share your screen as a GIF. Skitch - A screen capture application with a powerful annotation capabilities. Teampaper Snap - Let your screenshots speak up. Monosnap - Make screenshots. Draw on it. Shoot video and share your files. It’s fast, easy and free. Jietu - Screenshot with a powerful annotation capabilities, by Tencent. ScreenShot PSD - Capture the screen as a layered PSD for easy editing. Snip - An application for sharing captured images on QQ Mail. iPic - Easily upload images with Markdown supported. Iconjar - Icon management tool to organize or search your icons. svgus - Organize, clean and transform your SVGs. RightFont - Preview, sync, install and manage fonts on Mac, Dropbox or Google Drive. Solarized - Clean and beautiful color theme. Works well with iTerm, JetBrains products, Vim etc. Virtual Machines Parallels - Powerful, easy-to-use VM. No free upgrade for each new Mac OS. Virtual Box - A powerful x86 and AMD64/Intel64 virtualization product. VMWare Fusion - A powerful, commercial VM developed by VMware. Veertu - The lightest VM on Mac. A responsive, sandboxed &amp; native way to run VM on your Mac. CommunicationTeam communication and collaboration tools Franz - An Electron based, multi-protocol wrapper for web-based chat client. One application, 23 messenger services. QQ - Official QQ app for Mac. WeChat - Official WeChat app for Mac. Electronic WeChat - An open-source WeChat client, build with Electron. Skype - A cross-platform application that provides video chat and voice call services. Users can exchange images, text, video and any other digital documents. Maipo - A third-party Weibo client for Mac OS. 御飯 - A third-party FanFou client for Mac OS. ChitChat - Unofficial WhatsApp. Telegram - A messaging app with a focus on speed and security. Messenger For Mac - A third-party Facebook messenger for Mac. Adium - A free instant messaging application for Mac OS X, connecting to AIM, MSN, SMPP, Yahoo and more. Textual - Textual is the world’s most popular application for interacting with Internet Relay Chat (IRC) chatrooms on OS X. Gitter - An instant messaging and chat room system for developers as well as GitHub users. Developer friendly with Markdown syntax support. 简聊 - A communication tool for enterprise use. You can build your own service with its open-source version. 钉钉 - A free office communication platform for enterprise use. LimeChat - An open-source IRC client for Mac OS X. Slack - Awesome tool for team collaboration and communication. 零信 - Work anywhere at anytime. Cross platform. 今目标 - An internet work platform for small-to-medium sized enterprises. BearyChat - Team collaboration and communication tool for internet-based teams. Bitpost - A private decentralized messaging system. Instead of connecting to centralized servers(like Facebook, Gmail etc.) or federated servers(like email, IRC, Jabber), it uses P2P protocol to send encrypted messages to another person or to many subscribers. Teambition - A team collaboration tool, including many features like task plan, schedule, file sharing, instant discussion and everything you need when collaborating with other team members. WeeChat - The extensible command-line chat client. Rambox - messaging and emailing app that combines common web applications into one. Email Clients Spark - A fast email client. For both Mac OS and iOS. Airmail - A fast email client. For both Mac OS and iOS. Nylas Mail - An extensible desktop mail app built on the modern web. Foxmail - A fast email client. Mail Master - Netease full platform of the mailbox management client. MailTags - Use tags to organize email and schedule N1 - An extensible, open-source mail app, free for developers and $7/month for Pro. Postbox - A powerful, simple and beautiful email client, need to pay for a license. Polymail - Simple, beautiful and powerful email client. Newton(formerly Cloudmagic) - An excellent email client with concise interface, scheduling and read receipts. ThunderBird - Software made to make email easier.。 Yomail - Maybe the best email client for email。 Data Recovery Tools DiskWarrior - The world’s most advanced repair and recovery tool for Mac. Data Rescue - A comprehensive and professional data recovery tool for most cases. Stellar Phoenix Mac Data Recovery - A powerful recovery tool for Mac file recovery, Time machine recovery, Encrypted Disk recovery and much more. R-Studio for Mac - A powerful tool which recovers data on disks, even if their partitions are formatted, damaged or deleted. Audio and Video Tools Popcorn Time - Watch torrent movies instantly, This Popcorn Time service will never be taken down. Download and enjoy. Kodi - An award-winning free and open-source (GPL) software media center for playing videos, music, pictures, games, and more. mpv - A free, open-source, and cross-platform media player. IINA - The modern video player for macOS, Based on mpv, the powerful media player project. Soda Player - A player that can play seed, magnetic links, online video, automatic captions, links and local video files. VOX Player - #1 high-definition audio player for Mac and iPhone. Music just sounds better! Radiant Player - Third party Google Play Music client. Sonora - A minimal, beautifully designed music player. Audacity - A free, open-source, cross-platform audio software for multi-track recording and editing. Natron - Open-source compositing software. Node-graph based. Similar in functionalities to Adobe After Effects and Nuke by The Foundry. Ardour - Cross-platform audio software for multi-track recording and editing. Hydrogen - Professional yet simple and intuitive pattern-based drum programming for GNU/Linux. Audio Hijack - Record any application’s audio, including VoIP calls from Skype, web streams from Safari, and much more. Stringed 2 - Music practice software designed to help users learn how to play their favorite songs. Mixxx - The most advanced free DJ software. MuseScore - Free, open-source music notation software. Cog - A free, open-source audio player. Elmedia Player - This media player is a super versatile app for any file format you probably may think of: FLV, MP4, AVI, MOV, DAT, MKV, MP3, FLAC, M4V are all supported as well as many others. VLC - A free, open-source, cross-platform multimedia player as well as framework that plays most multimedia files, DVDs, Audio CDs, VCDs and various streaming protocols. XLD - A tool to decode, convert and play various ‘lossless’ audio files. HandBrake - A tool for converting video from nearly any format to a selection of modern, widely supported codecs. MPlayerX - A simple, powerful, beautiful media player. Playback - Experimental video player. ScreenFlow - Screencasting and video editing software. Shotcut - Free open-source video editor. ArcTime - A simple, powerful, efficient subtitle creation software. Perian - (Retired, no longer supported) Let QuickTime play all the common formats of free plug-ins. Adapter - Free audio, video and image conversion software. Synfig Studio - Synfig Studio is free, open-source 2D animation software. Aegisub - Aegisub is a free, cross-platform open source tool for creating and modifying subtitles. Aegisub makes it quick and easy to time subtitles to audio, and features many powerful tools for styling them, including a built-in real-time video preview. iFFmpeg - A Comprehensive Media Tool for macOS. Making High Quality Video Encoding Accessible for Everyone. Reading and Writing Tools OpenOffice - Compatible with other major office suites, Apache OpenOffice is free to download, use, and distribute. 。 LibreOffice - LibreOffice is free and open-source software. Development is open to new talent and new ideas, and our software is tested and used daily by a large and devoted user community. KOffice - KOffice contains a word processor (KWord), a spreadsheet (KSpread), a presentation program (KPresenter), and a number of other components that varied over the course of KOffice’s development. Spillo - Powerful, beautiful and amazingly fast Pinboard client for OS X. iChm - An ebook reader for CHM (Microsoft Compiled HTML help) files. Chmox - Read CHM documents on your Mac. CHM Reader - Read Compiled HTML (.chm) documents on your Mac. Skim - A PDF reader and note-taker for OS X. PDF Expert - Read, annotate and edit PDFs, change text and images. MarginNote - An in-depth PDF and EPUB reading, learning, managing and note taking app. Kindle App - Amazon official reading app of kindle. Klib - A new way to manage highlights for Kindle and iBooks. texpad - A great LaTeX editor for Mac with auto-update PDF and autocomplete LaTeX commands. Bear Writer - Bear is a beautiful, flexible writing app for crafting notes and prose. Boostnote - note-taking app made for programmers. QOwnNotes - Is the open source notepad with markdown support and todo list manager. RSS Feeds 2 - Keep tabs on your favorite website and RSS feeds from your Mac’s menubar. ReadKit - A Mac read later client supporting all major providers: Instapaper, Pocket and Readability. Even more, ReadKit is a full-featured RSS reader as well. Reeder 3 - A news reader for Feedbin, Feedly, Feed Wrangler and so on. Leaf - An amazing news reader dedicated to help you enjoy your daily news and easily manage your subscriptions. Vienna - An RSS/Atom reader for Mac OS X. Markdown Yu Writer - A Markdown text editor that can find writing fun. ![tuijian] ![必备] Mou - A Markdown editor for developers, on Mac OS X. Marp - A Markdown presentation writer with cross-platform support. TextNut - A rich-format editor featuring Markdown export and Markdown syntax hints. MWeb - Pro Markdown writing, note taking and static blog generator App. Typora - A truly minimal Markdown editor featuring seamless live preview. MacDown - An open-source Markdown editor for OS X. EME - Recently launched a Markdown editor, interface is like Chrome browser interface, very simple. LightPaper - Simple, beautiful, yet powerful text editor for your Mac. Marked 2 - Markdown previewer, reviewer, and exporter. Great for people that already have a preferred way of editing Markdown, but want to get a live preview of the document they are working on. iA Writer - Writing app with an emphasis on simplicity and design. Ultimate - The Ultimate Writing App for Mac, iPad and iPhone. Cmd Markdown - Cmd Markdown Open the journey of excellence. Note-taking Quiver - The Programmer’s Notebook, lets you easily mix text, code, Markdown and LaTeX within one note, edit code with an awesome code editor and live preview Markdown and LaTeX. Evernote - Infamous note-taking app, available on many platforms. OneNote - Note-taking app by Microsoft. Inkdrop - The notebook app for Markdown lovers built on top of Electron. Notes - A clean, simple note-taking app. Notebook Note-taking app. 有道云笔记 - A note-taking app. It features multi-level notebook structure，Markdown syntax and iWork/Office preview. 为知笔记 - A note-taking app. It features multi-level notebook structure, multi tags, Markdown syntax and unlimited cloud storage space. Leanote - A note-taking app. Features Markdown syntax and blog export. Ebooks Calibre - A free and open-source e-book computer software application suite which runs on multiple platforms, allows users to manage e-book collections as well as create, edit, and read e-books. Sigil - A multi-platform EPUB ebook Editor. Scribus - Professional layout and publishing software supporting EPS and SVG import/export, and PDF support. FTP Clients Transmit - A highly flexible and intuitive FTP client, supports SFTP, S3 and iDisk/WebDAV. Flow - An award-winning, beautiful, fast, and reliable FTP + SFTP client. Yummy FTP - Pro-level, fast, reliable FTP/S + SFTP + WebDAV/S file transfer app. Cyberduck - A libre FTP, SFTP, WebDAV, S3, Backblaze B2, Azure and OpenStack Swift browser. FileZilla - A free software, cross-platform FTP application. Supports FTP, SFTP and FTPS (FTP over SSL/TLS). Frameworks For Hybrid Applications create-dmg - Create a good-looking DMG for your macOS app in seconds. nw.js - Build desktop application with HTML and JavaScript. It lets you call all Node.js modules directly from DOM and enables a new way of writing applications with all Web technologies. Electron - Build cross platform desktop application with JavaScript, HTML and CSS. Electrino - Desktop runtime for apps built on web technologies, using the system’s own web browser engine. react-desktop - React UI Components for macOS Sierra. ReactXP - Microsoft official production, support platform Web, iOS, Android and Windows UWP is still an ongoing work. React Native macOS - Build OS X desktop apps using React Native and Cocoa. React Native for Ubuntu - Build Ubuntu desktop apps using React Native. AppJS - A lightweight JavaScript UI library for creating mobile webapps that behave like native apps. HEX - Build cross-platform desktop application with HTML and JavaScript. Made by YouDao. (Broken official website) AlloyDesktop - Build cross-platform desktop application with HTML and JavaScript. Made by Tencent (Not very recommended). MacGap - Provides a lightweight JavaScript API for OS X integration, such as displaying native notifications or writing data to a file. ionic - Build amazing native and progressive web apps with Angular and open web technologies. One app running on everything. Download Management Tools Transmission - A Fast, Easy, Free BitTorrent Client. aria2 - A lightweight multi-protocol &amp; multi-source command-line download utility. JDownloader - A free, open-source download management tool with a huge community of developers that makes downloading as easy and fast as it should be. You-Get - A tiny command-line utility to download media contents (videos, audios, images) from the web. Free Download Manager - A powerful, modern download accelerator and organizer for Windows and Mac. (FREE) FOLX - A free download manager for Mac OS X with a true Mac-style interface. Downie - Video downloader for macOS with support for YouTube and other 1200 sites. Online StorageI recommend using online storage with Mac clients Dropbox - A file hosting service that offers cloud storage and file synchronization with collaborative edit features. Baidu cloud - Baidu cloud official client. Tecent cloud - Tencent cloud client. (Require Tencent Account, Missing English UI and Docs) Jianguo cloud - Jianguo cloud client. (Not recommended) 115 - 115 cloud client. ~~360 - 360 cloud client. ~~ ownCloud Cloud storage. NextCloud - An actively maintained fork of ownCloud, faster and completely open-source Mega - Free cloud service, offers 50GB free storage. Seafile - Reliable and High Speed File Sync and Share. Input Methods ~~QQ Input for Chinese - Produced by Tencent. ~~ Sogou Input for Chinese - Sogou input. Baidu Input for Chinese - Baidu input. Qingge Wubi Input - Wubi input produced for iOS and Mac. WBIM - Wubi input method. Emoticon Input - Emoticons icons or characters input method. RIME - Rime input method. hallelujahIM - hallelujah English input method. Rocket - Makes typing emoji faster and easier using Slack-style shortcuts. Web BrowsersBrowsers on Mac OS Safari - Built-in browser of Mac OS. Chrome - Chrome, produced by Google Chromium - Chromium is an open-source web browser project by Google, to provide the source code for Google Chrome. Firefox - Firefox is a free, open-source web browser developed by the Mozilla Foundation. Opera - Opera. QQ Browser - QQ browser, produced by Tencent. 傲游云浏览器 - Vivaldi - Vivaldi, new browser from Opera’s developers. Ōryōki - Ōryōki, small web browser with a thin interface. This is an experimental project, currently in development. Brave - Web browser with an emphasis on privacy and speed. Translation Tools(Or you could just use the Mac OS built-in dictionary) iTranslate - Translate entire website instantly with its built-in browser or with iTranslate Safari extension into over 40 languages. YouDao Translate - 海词词典 - Eudic - Grammarly - Refine your english Proxy and VPN Tools SpechtLite - A rule-based proxy app for macOS. ShadowsocksX - A secure socks5 proxy, designed to protect your internet traffic. ShadowsocksX-NG - Next generation of ShadowsocksX. Lantern - Lantern is a free application that delivers fast, reliable and secure access to the open internet. 鱼摆摆 - An application for the access to open internet. Tunnelbear - Really simple VPN to browse the web privately &amp; securely. Unblock websites around the world with applications for Mac, PC, iOS, Android &amp; Chrome. Tunnelblick - A free, open-source graphic user interface for OpenVPN on OS X. GoAgentX - An application for the access to open internet. Surge - Surge is a web developer tool and proxy utility for iOS 9. srocket - An application for the access to open internet. LoCoVPN - An application for the access to open internet. 二师兄VPN - An application that connects you to the VPN. GTX加速器 - An application that connects you to the VPN. GreenVPN - A powerful and fun tools that helps you to solve any network issues. (Mainly used for the access to open internet) WiseVPN - Unlimited traffic, free VPN. 风驰VPN - An application that connects you to the VPN. 开眼 - A Chrome plugin for the access to open internet. PlutoX - An application that connects you to the VPN. tinc - Secure mesh VPN software. Shimo - VPN Client for Mac, provides many features related to VPN usage. FreeVPN Plus - Never expired Mac free VPN. UtilitiesGeneral Tools Alfred - An award-winning app for Mac OS X which boosts your efficiency with hotkeys, keywords, text expansion and more. Search your Mac and the web, and be more productive with custom actions to control your Mac. BetterZip 3 - An archive tool supports ZIP, TAR, TGZ, TBZ, TXZ (new), 7-ZIP, RAR。 Keka - A free file archiver for macOS. Compression formats supported:7z, Zip, Tar, Gzip, Bzip2, DMG, ISO. Extraction formats supported: RAR, 7z, Lzma, xz, Zip, Tar, Gzip, Bzip2, ISO, EXE, CAB, PAX. Numi - A beautiful calculator app for Mac. Memo - Memo is a simple and elegant app,Unlock memos even more quickly using Touch ID. Itsycal - A tiny calendar for your Mac’s menu bar. BitBar - An app lets you put the output from any script or program right in your Mac OS X menu bar. Has a good community. ClipMenu - A clipboard manager for Mac OS X. Paste - Smart clipboard history &amp; snippets manager. iPaste - Lightweight and efficient clipboard tool. ControlPlane - Manages configuration profiles for your Mac. Determines where you are or what you are doing based on a number of available evidence sources and then automatically reconfigures your Mac based on your preferences. AirServer - The most advanced screen mirroring software receiver for Mac, PC and Xbox One. Hazel - Automated file organization for your Mac. Responsibly and beautifully designed. MacAssistant - Google Assistant for macOS muCommander - A lightweight file manager with a dual-pane interface. GTD (Getting Things Done) Todoist - A cross-platform todo list app. dida365 - Lightweight to-do application。 TaskPaper - Plain text to-do lists. Fantastical - The calendar app you won’t be able to live without. Day-O 2 - Menu bar clock replacement with built-in calendar. Things - A delightful and easy to use task manager. (Award-winning App) OmniFocus - A nice GTD app, made by OmniGroups. 2Do - A nice todo app. Wunderlist - The easiest way to get stuff done. OnyX - Multifunction utility to verify disks and files, run cleaning and system maintenance tasks, configure hidden options and more. Focus - A beautiful pomodoro-based time manager. Productivity xScope - A powerful set of tools that are ideal for measuring, inspecting &amp; testing on-screen graphics and layouts. Karabiner - A powerful and stable keyboard customizer for OS X. Ukelele - Unicode Keyboard Layout Editor. Keytty - A app to keep your hands on the keyboard. Move, click, scroll, drag and more with a few strokes. Mos - A simple tool can offer the smooth scrolling and reverse the mouse scrolling direction on your Mac. BetterTouchTool - A great, feature-packed app that allows you to configure many gestures for your Magic Mouse, Macbook Trackpad, Magic Trackpad and also Mouse Gestures for normal mice. Hammerspoon - A tool for powerful automation of OS X, programmable by Lua scripting engine. Qbserve - Time tracking automation: freelance project tracking, timesheets, invoicing &amp; real-time productivity feedback. Timing - Automatic time and productivity tracking for Mac. Helps you stay on track with your work and ensures no billable hours get lost if you are billing hourly. Window Management ShiftIt - Managing window size and position in OSX. Moom - Allows you to easily move and zoom windows, or to another display—using either the mouse or the keyboard. Divvy - Window management at its finest with its amazing Divvy Grid system. Slate - A window management application similar to Divvy and SizeUp (except better and free!). (Needs config file) SizeUp - Powerful, keyboard-centric window management. Spectacle - Move and resize windows with simple and customizable keyboard shortcuts. Amethyst - A tiling window manager. Magnet - A window manager that keeps your workspace organized. Password Management 1Password - A cross-platform password management tool. LastPass - A password management tool for Mac OS and browser. KeePassX - A light-weight and open-source password management app. MacPass - An open-source KeePass Mac OS client. Keeweb - Free cross-platform password manager compatible with KeePass. Finder Quicklook-Plugins - A list of useful “Quick Look” plugins for developers. ForkLift - The most advanced dual pane file manager and file transfer client for macOS. Path Finder - An all-around file management app. TotalFinder - A Chrome-like app as finder substitute. XtraFinder - Adds tabs and cut to Mac Finder. Quality of Life Improvements CheatSheet - Hold the ⌘-Key to get a list of all active shortcuts of the current application. It’s as simple as that. Snap - Launch an app in a snap. Ridiculously easy shortcut management. KeyCastr - An open-source keystroke visualizer. f.lux - An application makes the color of your computer’s display adapt to the time of day. System Related Tools AppCleaner - A small application which allows you to thoroughly uninstall unwanted apps. iStats - iStats is a command-line tool that allows you to easily grab the CPU temperature, fan speeds and battery information on OS X. Juice - Make your battery information a bit more interesting by making your own measurement scale instead of a boring battery indicator. NitroShare - CROSS-PLATFORM NETWORK FILE TRANSFER APPLICATION. Monity - A system monitoring widget for OS X. SSH Tunnel - An application to manage your SSH. Mounty - A tiny tool to re-mount write-protected NTFS volumes under Mac OS X 10.9+ in read-write mode. Paragon NTFS - Read/write access to NTFS in macOS Sierra. Tuxera NTFS - Full read-write compatibility with NTFS-formatted drives on a Mac. gfxCardStatus - An unobtrusive menu bar app for OS X that allows MacBook Pro users to see which apps are affecting their battery life by using the more power-hungry graphics. DaisyDisk - Gives you a great overview of disk usage. Can also make more disk-space available by cleaning up your disk. OmniDiskSweeper - Shows you the files on your drive, ordered by size. It can be used to find and remove unused files. iStat Menus - An advanced Mac system monitor on the menubar. HTML5 Player - An HTML 5 video player. Keep your Mac from “burning”. InsomniaX - Disable either lid and/or idle sleep (so you can play music with your lid closed, for example). Caffeine - An app that doesn’t let your Mac to fall asleep. KeepingYouAwake – Alternative to Caffeine with better support for dark mode in Mac. ! NoSleep NoSleep makes closing of your MacBook lid possible without going into sleep mode. Coolant - A menubar app that lets you know when an app is consuming 100% CPU or more than a gigabyte of memory (or any arbitrary limits you choose). HandShaker - Mac on the management of Android mobile phone content. Gaming Software OpenEmu - A great video game console emulator, supports many different emulators in a single application. (e.g. Sony PSP, GameBoy, NDS and so on) Other WWDC - The Mac OS unofficial WWDC app. Remote Login Software TeamViewer - A proprietary computer software package for remote control, desktop sharing, online meetings, web conferencing and file transfer between computers. RealVNC The original and best software for remote access across desktop and mobile. AnyDesk An application which provides Remote access across multiple machines. QuickLook PluginsUsing Homebrew Cask to install. List of useful Quick Look plugins for developers. If you install it manually, you can move the downloaded .qlgenerator file to~ / Library / QuickLook qlmanage -r QuicklookStephen - Preview plain text files without or with unknown file extension. such as README、INSTALL、Capfile、CHANGELOG…brew cask install qlstephen QLColorCode - Preview source code files with syntax highlighting. brew cask install qlcolorcode QLMarkdown - Preview Markdown files. brew cask install qlmarkdown QuickLookJSON - Preview JSON files. brew cask install quicklook-json QLPrettyPatch - Preview .patch files. brew cask install qlprettypatch QuickLookCSV - Preview CSV files. brew cask install quicklook-csv BetterZipQL - Preview the compressed format file for BetterZip software. brew cask install betterzipql qlImageSize - Display image size and resolution. brew cask install qlimagesize WebP - Preview WebP images. brew cask install webpquicklook Suspicious Package - Preview the contents of a standard Apple installer package. brew cask install suspicious-package QuickLookASE - Preview Adobe ASE Color Swatches generated with Photoshop，Illustrator，Prisma among many others. brew cask install quicklookase QLVideo - Preview most types of video files, as well as their thumbnails, cover art and metadata. brew cask install qlvideo QuickLookAPK - Preview Android APK files. brew cask install quicklookapk ProvisionQL - Preview iOS / macOS app and provision information. brew cask install provisionql quicklook-pat - Preview Adobe Photoshop pattern files. brew cask install quicklook-pat Third Party App MarketsIf you come across websites offering pirated software or cracks, please post HERE. We love apps, but only authentic ones. :) Get AppsHere are some of the major software download sites, there are a number of OSX Mac software sites MacUpdate Desktop - Simplifies finding, buying and installing apps for your Mac. Homebrew Cask - A command line installation manager which extends Homebrew and brings its elegance, simplicity, and speed to Mac OS applications and large binaries alike. Homebrew - The missing package manager for macOS. MacPorts - The MacPorts Project is an open-source community initiative to design an easy-to-use system for compiling, installing, and upgrading either command-line, X11 or Aqua based open-source software on the Mac OS X operating system. Black-ListThird party app market black list 腾讯电脑管家 - 电脑管家for Mac 带应用市场。 迅雷Thunder Store - 迅雷Thunder for Mac 带应用市场。 Mac软件宝箱 - Macx推出软件宝箱。 MacHunter - Mac应用市场。 Mac App Download SitesHere are some of the major software download sites, there are a number of OSX Mac software sites Genuine Sites Slant - I personally recommend this. This is a platform where you can compare apps side-by-side, you might get an idea by seeing other users recommendations. Please contribute if you find an application from this list! alternativeTo - Also a very nice community. If you are looking for some alternative apps FOR Windows or another platform, check this site. Other sites like MacStories, LifeHacker, ProductHunt are great resources. Also, Quora, Reddit, you know the drill. MacUpdate：https://www.macupdate.com/ App Shopper：http://appshopper.com/ HackStore An amazing free alternative to the App Store for side developers and apps for Mac OS which Apple doesn’t accept. Chinese community 少数派：http://sspai.com/tag/Mac Mac玩儿法：http://www.waerfa.com Pirated software download site blacklistRefuse piracy from me. Software vendors can go to these places rights. 玩转苹果：http://www.ifunmac.com Mac软件下载站：http://www.pshezi.com MacPeers：http://www.macpeers.com Mac志：http://www.isofts.org Mac软件分享：http://www.waitsun.com AppKed：http://www.macbed.com 苹果软件园：http://www.maczapp.com Mac精品软件：http://xclient.info/ Macx：http://www.macx.cn/ 腾牛网：http://www.qqtn.com/mac/r_17_1.html ⬆ Top : https://jaywcjlove.github.io/sb/ico/min-oss.svg “Open Source Software”: https://jaywcjlove.github.io/sb/ico/min-free.svg “Free Software”: https://jaywcjlove.github.io/sb/ico/min-hot.svg “Hot Software”: https://jaywcjlove.github.io/sb/ico/min-tuijian.svg “Recommend Software”: https://jaywcjlove.github.io/sb/ico/min-bibei.svg “Must Have Software”: https://jaywcjlove.github.io/sb/star/red.svg “1 Star Software”: https://jaywcjlove.github.io/sb/ico/min-app-store.svg “App Store Software”","categories":[],"tags":[]},{"title":"One Day Traveling in Yinxing Lake","slug":"I-love-Xumengyue","date":"2017-09-14T14:47:34.000Z","updated":"2017-09-24T05:24:23.350Z","comments":true,"path":"2017/09/14/I-love-Xumengyue/","link":"","permalink":"http://yoursite.com/2017/09/14/I-love-Xumengyue/","excerpt":"","text":"One Day Traveling in Yinxing Lake","categories":[],"tags":[]},{"title":"Web crawling CSI 300 index using Python","slug":"Web crawling CSI 300 index using Python","date":"2017-08-08T04:48:03.000Z","updated":"2017-08-08T12:54:17.000Z","comments":true,"path":"2017/08/08/Web crawling CSI 300 index using Python/","link":"","permalink":"http://yoursite.com/2017/08/08/Web crawling CSI 300 index using Python/","excerpt":"","text":"Simulating browser loginYou must make sure that you have installed firefox browser. 123456789from selenium import webdriverfrom selenium.webdriver.common.keys import Keysimport timeimport pandas as pdimport reimport numpy as npfrom bs4 import BeautifulSoupdriver = webdriver.Firefox() Finding the CSI 300 index url in Google Finance1234567891011121314151617181920212223242526272829303132333435363738394041var = [&apos;Date&apos;, &apos;Open&apos;, &apos;High&apos;, &apos;Low&apos;, &apos;Close&apos;, &apos;Volume&apos;]csi = &#123;&#125;for j in range(0,29): urll = &quot;https://www.google.com/finance/historical?cid=1979150&amp;startdate=Jan%201%2C%202014&amp;enddate=Jul%2010%2C%202017&amp;num=30&amp;ei=BxBkWdGLK5DijAHogaDwCg&quot;+&quot;&amp;start=%s&quot; % (j*30) driver.get(urll) html = BeautifulSoup(driver.page_source,&apos;lxml&apos;) info = html.find_all(&apos;table&apos;, class_=&quot;gf-table historical_price&quot;) info1 = info[0] info3 = info1.find_all(&quot;td&quot;) for i in range(len(info3)-1): if i % 6 == 0: valuetag = info3[i] value = valuetag.string value = value.replace(&quot;\\n&quot;,&quot;&quot;) csi.setdefault(var[0],[]).append(value) elif i % 6 == 1: valuetag = info3[i] value = valuetag.string value = value.replace(&quot;\\n&quot;,&quot;&quot;) csi.setdefault(var[1],[]).append(value) elif i % 6 == 2: valuetag = info3[i] value = valuetag.string value = value.replace(&quot;\\n&quot;,&quot;&quot;) csi.setdefault(var[2],[]).append(value) elif i % 6 == 3: valuetag = info3[i] value = valuetag.string value = value.replace(&quot;\\n&quot;,&quot;&quot;) csi.setdefault(var[3],[]).append(value) elif i % 6 == 4: valuetag = info3[i] value = valuetag.string value = value.replace(&quot;\\n&quot;,&quot;&quot;) csi.setdefault(var[4],[]).append(value) else: valuetag = info3[i] value = valuetag.string value = value.replace(&quot;\\n&quot;,&quot;&quot;) csi.setdefault(var[5],[]).append(value) Writing file in local folder1234data = pd.DataFrame.from_dict(csi,orient=&apos;index&apos;).Tdata.to_csv(&apos;data.csv&apos;,header = True,encoding=&quot;utf_8_sig&quot;)","categories":[],"tags":[]},{"title":"Install R and RStudio in Ubuntu","slug":"Install-R-and-RStudio-in-Ubuntu","date":"2017-08-07T04:48:03.000Z","updated":"2017-08-08T12:53:49.000Z","comments":true,"path":"2017/08/07/Install-R-and-RStudio-in-Ubuntu/","link":"","permalink":"http://yoursite.com/2017/08/07/Install-R-and-RStudio-in-Ubuntu/","excerpt":"","text":"Install RAdd Mirror source12sudo gedit /etc/apt/sources.listdeb http://cran.rstudio.com/bin/linux/ubuntu trusty/ # Add the code in the end of sources.list Run command of downloading public key12sudo apt-key adv --keyserver keyserver.ubuntu.com --recv-keys 51716619E084DAB9sudo apt-get update # Update Install R12sudo apt-get install r-baseR # Verify whether it succeed Install RStudioVisit http://www.rstudio.com/products/rstudio/download/ download related file Input code in Terminal123sudo apt-get install gdebi-coresudo apt-get install libapparmor1 # Required only for Ubuntu, not Debiansudo gdebi * # Downloaded RStudio*.deb file","categories":[],"tags":[]},{"title":"Install Hadoop on Ubuntu","slug":"Install Hadoop on Ubuntu","date":"2017-08-07T04:48:03.000Z","updated":"2017-08-08T12:54:04.000Z","comments":true,"path":"2017/08/07/Install Hadoop on Ubuntu/","link":"","permalink":"http://yoursite.com/2017/08/07/Install Hadoop on Ubuntu/","excerpt":"","text":"Install JDKVisit http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html and download jre-8u121-linux-x64.tar.gz file to Home. Open terminal, get root and create new folder on the home1234sudo passwd root # set root passwordsu # get rootgedit /etc/sudoers # add chan ALL(ALL) ALL to behind root linesudo mkdir hadoop # create new folder Copy jre-8u121-linux-x64.tar.gz file to hadoop folder1cp jre-8u121-linux-x64.tar.gz /home/chan/hadoop # chan is user name Explode jre-8u121-linux-x64.tar.gz file123cd home/chan/hadooptar -zxvf jre-8u121-linux-x64.tar.gz # exploderm jre-8u121-linux-x64.tar.gz # delete Set JDK environment variable1sudo gedit /etc/profile Add codes at the end of profile123export JAVA_HOME=/home/name(user)/hadoop/jre1.8.0_121 # the name of the JDK folderexport PATH=$JAVA_HOME/bin:$PATHexport CLASSPATH=.:$JAVA_HOME/lib/dt.jar:$JAVA_HOME/lib/tools.jar Check12source /etc/profile # make JDK effectivejava -version # showing java version &quot;xxxx&quot;, it succeed Configure hosts fileRevise hostname123sugedit etc/hostname # revise hostname to &quot;master&quot; and input slave1, slave2 in othersreboot Check IP address1ifconfig # copy IP address Configure host12sugedit /etc/hosts #paste IP address and input &quot;master&quot;, &quot;slave1&quot;, &quot;slave2&quot; Copy configured host to slaves12scp /etc/hosts root@slave1:/etc/scp /etc/hosts root@slave2:/etc/ 2.5 Check slavers whether connected 12ping slave1 # must input in masterping slave2 SSH login without passwordTurn off firewall123susysv-rc-conf iptables off # need install sys-rc-confreboot Configure SSH in master123456ssh-keygen -t rsa # press ENTERcd .sshcat id_rsa.pub &gt;&gt; authorized_keyschmod 600 authorized_keysscp authorized_keys chan@slave1:~/.ssh/scp authorized_keys chan(user)@slave2:~/.ssh/ Check for success123ssh slave1ssh slave2shh master Install and configure Hadoop in masterVisit http://apache.fayea.com/hadoop/common/ and download hadoop-2.6.4.tar.gz Copy hadoop-2.6.4.tar.gz to hadoop folder12cd hadooptar -zxvf hadoop-2.6.4.tar.gz Configure files of HadoopConfigure hadoop-env.sh12345cd hadoop/hadoop-2.6.4cd etc/hadoopgedit hadoop-env.sh# add this code at end of hadoop-env.shexport JAVA_HOME=/home/chan/hadoop/jre1.8.0_121 Configure core-site.xml12345678910111213141516gedit core-site.xml# add this code between configuration&lt;property&gt; &lt;name&gt;fs.default.name&lt;/name&gt; &lt;value&gt;hdfs://master:9000&lt;/value&gt; &lt;final&gt;true&lt;/final&gt;&lt;/property&gt;&lt;property&gt; &lt;name&gt;hadoop.tmp.dir&lt;/name&gt; &lt;value&gt;/home/chan/hadoop/tmp&lt;/value&gt; # user name&lt;/property&gt;&lt;property&gt;&lt;name&gt;fs.default.name&lt;/name&gt; &lt;value&gt;hdfs://master:54310&lt;/value&gt; &lt;final&gt;true&lt;/final&gt;&lt;/property&gt; Configure hdfs-site.xml12345678910111213141516gedit hdfs-site.xml# add this code between configuration&lt;property&gt; &lt;name&gt;fs.default.name&lt;/name&gt; &lt;value&gt;file:/home/chan/hadoop/dfs/name&lt;/value&gt; # user name &lt;final&gt;true&lt;/final&gt;&lt;/property&gt;&lt;property&gt;&lt;name&gt;dfs.datanode.data.dir&lt;/name&gt; &lt;value&gt;file:/home/chan/hadoop/dfs/data&lt;/value&gt; #user name &lt;final&gt;true&lt;/final&gt;&lt;/property&gt;&lt;property&gt;&lt;name&gt;dfs.replication&lt;/name&gt; &lt;value&gt;2&lt;/value&gt;&lt;/property&gt; Configure mapred-site.xml12345678910111213141516mv mapred-site.xml.template mapred-site.xml # renamegedit mapred-site.xml# add this code between configuration&lt;property&gt; &lt;name&gt;mapreduce.framework.name&lt;/name&gt; &lt;value&gt;yarn&lt;/value&gt;&lt;/property&gt;&lt;property&gt;&lt;name&gt;mapreduce.jobhistory.address&lt;/name&gt; &lt;value&gt;master:10020&lt;/value&gt; &lt;final&gt;true&lt;/final&gt;&lt;/property&gt;&lt;property&gt; &lt;name&gt;mapreduce.jobhistory.webapp.address&lt;/name&gt; &lt;value&gt;master:19888&lt;/value&gt;&lt;/property&gt; Configure yarn-site.xml123456789101112131415161718192021222324252627282930gedit yarn-site.xml# add this code between configuration&lt;property&gt; &lt;name&gt;yarn.nodemanager.aux-services&lt;/name&gt; &lt;value&gt;mapreduce_shuffle&lt;/value&gt;&lt;/property&gt;&lt;property&gt;&lt;name&gt;yarn.nodemanager.aux-serivces.mapreduce.shuffle.class&lt;/name&gt; &lt;value&gt;org.apache.hadoop.mapred.ShuffleHandler&lt;/value&gt;&lt;/property&gt;&lt;property&gt; &lt;name&gt;yarn.resourcemanager.address&lt;/name&gt; &lt;value&gt;master:8032&lt;/value&gt;&lt;/property&gt;&lt;property&gt; &lt;name&gt;yarn.resourcemanager.scheduler.address&lt;/name&gt; &lt;value&gt;master:8030&lt;/value&gt;&lt;/property&gt;&lt;property&gt;&lt;name&gt;yarn.resourcemanager.resource-tracker.address&lt;/name&gt; &lt;value&gt;master:8031&lt;/value&gt;&lt;/property&gt;&lt;property&gt; &lt;name&gt;yarn.resourcemanager.admin.address&lt;/name&gt; &lt;value&gt;master:8033&lt;/value&gt;&lt;/property&gt;&lt;property&gt; &lt;name&gt;yarn.resourcemanager.webapp.address&lt;/name&gt; &lt;value&gt;master:8088&lt;/value&gt;&lt;/property&gt; Configure master123gedit master#add this codemaster Configure slaves12345gedit slaves#add this codemasterslave1slave2 Copy configured files to slaves1234cdcd hadoopscp -r hadoop-2.6.4 slave1:~/hadoopscp -r hadoop-2.6.4 slave2:~/hadoop Start cluster1234cdcd hadoop/hadoop-2.6.4bin/hdfs namenode -format # format namenodesbin/start-all.sh Check cluster1jps # maybe need install","categories":[],"tags":[]}]}